# Clase 3
## Indexación y funciones

In [5]:
import pandas as pd
import numpy as np

In [7]:
# Creamos listas de Grados, y luego un diccionario
students = [ "Gissela", "Daniel", "Andres", "Sandra", "Rosalyn" ]
math     = [ 16, 14, 17, 17, 17 ]
english  = [ 16, 17, 19, 18, 15 ]
art      = [ 11, 17, 13, 14, 17 ]

# Dictionary
diplomado = {'Students':students, 'Math':math, 'English':english, 'Art':art}
gradesA1 = pd.DataFrame( diplomado)
gradesA1

  Students  Math  English  Art
0  Gissela    16       16   11
1   Daniel    14       17   17
2   Andres    17       19   13
3   Sandra    17       18   14
4  Rosalyn    17       15   17

In [9]:
#Empezamos a ordenar la base de datos según sus valores. Lo que hace Phyton es mostrarnos una ventana de cómo sería la BD ordenada. Sin embargo no modifica la BD original
gradesA1.sort_values("Students")

  Students  Math  English  Art
2   Andres    17       19   13
1   Daniel    14       17   17
0  Gissela    16       16   11
4  Rosalyn    17       15   17
3   Sandra    17       18   14

In [14]:
#Para ello, usamos la función inplace
gradesA1.sort_values("Students", inplace=True)
gradesA1

  Students  Math  English  Art
2   Andres    17       19   13
1   Daniel    14       17   17
0  Gissela    16       16   11
4  Rosalyn    17       15   17
3   Sandra    17       18   14

In [32]:
#Ahora vamos a crear una columna con el promedio de los almunos. Haremos operaciones matemáticas
gradesA1["promedio"] = (gradesA1["Math"]+gradesA1["English"]+gradesA1["Art"]) / 3
gradesA1

  Students  Math  English  Art   promedio
2   Andres    17       19   13  16.333333
1   Daniel    14       17   17  16.000000
0  Gissela    16       16   11  14.333333
4  Rosalyn    17       15   17  16.333333
3   Sandra    17       18   14  16.333333

In [33]:
#Ahora le pido a Phyton que elimine columnas. Para ello no solo tengo que señalarle el nombre de la columna, sino donde esta ubicado. Para ello, axis es el eje. El eje Y (horizontal, las filas) = 0, y el eje X (vertical, las columnas) = 1
gradesA1.drop("promedio", axis=1, inplace=False)

  Students  Math  English  Art
2   Andres    17       19   13
1   Daniel    14       17   17
0  Gissela    16       16   11
4  Rosalyn    17       15   17
3   Sandra    17       18   14

In [34]:
gradesA1

  Students  Math  English  Art   promedio
2   Andres    17       19   13  16.333333
1   Daniel    14       17   17  16.000000
0  Gissela    16       16   11  14.333333
4  Rosalyn    17       15   17  16.333333
3   Sandra    17       18   14  16.333333

In [30]:
#Agregamos una nueva data
# add new data gradesA2
students = [ "Rebeca", "Xavi", "Cristiano", "Ronaldo", "Leo" ]
math     = [ 15, 18, 14, 7, 10 ]
english  = [ 18, 9, 11, 12, 20 ]
art      = [ 10, 16, 20, 19, 5 ]

# Dictionary
grades_A2 = {'Students':students, 'Math':math, 'English':english, 'Art':art}
gradesA2 = pd.DataFrame( grades_A2 )
print( gradesA2 , "\n")
gradesA2

    Students  Math  English  Art
0     Rebeca    15       18   10
1       Xavi    18        9   16
2  Cristiano    14       11   20
3    Ronaldo     7       12   19
4        Leo    10       20    5

    Students  Math  English  Art
0     Rebeca    15       18   10
1       Xavi    18        9   16
2  Cristiano    14       11   20
3    Ronaldo     7       12   19
4        Leo    10       20    5

In [40]:
#Ahora vamos a concatenar
phyton_class = pd.concat([gradesA1, gradesA2], ignore_index=True)
#Nos sale desordenada, entonces le solicitamos ordenarlarla mejor con ignore_index

In [50]:
#Ahora, vamos a darle el promedio a todos, y lo ordenamos por promedios
phyton_class["promedio"] = (phyton_class["Math"]+ phyton_class["English"]+phyton_class["Art"]) / 3
phyton_class.sort_values("promedio")

    Students  Math  English  Art   promedio        avg
9        Leo    10       20    5  11.666667  31.666667
8    Ronaldo     7       12   19  12.666667  25.333333
2    Gissela    16       16   11  14.333333  35.666667
5     Rebeca    15       18   10  14.333333  36.333333
6       Xavi    18        9   16  14.333333  32.333333
7  Cristiano    14       11   20  15.000000  31.666667
1     Daniel    14       17   17  16.000000  36.666667
0     Andres    17       19   13  16.333333  40.333333
3    Rosalyn    17       15   17  16.333333  37.666667
4     Sandra    17       18   14  16.333333  39.666667

# Aplicamos a un caso real de manejo de base de datos

In [51]:
#Ahora vamos a leer bases de datos de GitHub: https://github.com/github/innovationgraph/tree/main/data

In [55]:
#Vamos a elaborar un análisis de datos unicamente a nivel de países de LATAM
#Obtenemos la data de github

import pandas as pd

url = "https://raw.githubusercontent.com/github/innovationgraph/refs/heads/main/data/repositories.csv"

#Carga directa del URL

df = pd.read_csv(url)
df

      repositories iso2_code  year  quarter
0         30669781        US  2020        1
1         20179087        CN  2020        1
2         17912888        EU  2020        1
3          9254535        IN  2020        1
4          4171705        GB  2020        1
...            ...       ...   ...      ...
4705           151        AQ  2025        1
4706           135        PM  2025        1
4707           117        MH  2025        1
4708           111        MS  2025        1
4709           110        KI  2025        1

[4710 rows x 4 columns]

In [58]:
## Renombremos de manera correcta las columnas

df.rename(columns={"repositories":"num_repos"}, inplace=True)
df

      num_repos iso2_code  year  quarter
0      30669781        US  2020        1
1      20179087        CN  2020        1
2      17912888        EU  2020        1
3       9254535        IN  2020        1
4       4171705        GB  2020        1
...         ...       ...   ...      ...
4705        151        AQ  2025        1
4706        135        PM  2025        1
4707        117        MH  2025        1
4708        111        MS  2025        1
4709        110        KI  2025        1

[4710 rows x 4 columns]

In [60]:
## Ahora seleccionamos valores solo para LATAM
#Para eso, pongamos de ejemplo la selección de casos donde solo está PERÚ
df[df["iso2_code"]=="PE"]
#Entonces, para seleccionar debes seleccionar la columna, y señalar que dato buscamos

      num_repos iso2_code  year  quarter
49       356948        PE  2020        1
263      391794        PE  2020        2
480      424103        PE  2020        3
698      456011        PE  2020        4
916      485312        PE  2021        1
1136     527124        PE  2021        2
1356     567869        PE  2021        3
1580     609800        PE  2021        4
1803     652580        PE  2022        1
2025     704939        PE  2022        2
2247     753704        PE  2022        3
2472     805264        PE  2022        4
2696     852209        PE  2023        1
2923     913172        PE  2023        2
3150     969559        PE  2023        3
3378    1021424        PE  2023        4
3604    1070001        PE  2024        1
3832    1138879        PE  2024        2
4058    1207493        PE  2024        3
4289    1280517        PE  2024        4
4518    1336842        PE  2025        1

In [99]:
#Ahora solo para LATAM
# List of South American ISO2 codes
south_america_codes = [
    "AR", "BO", "BR", "CL", "CO", "EC",
    "GY", "PY", "PE", "SR", "UY", "VE", "GF"  # GF optional (French Guiana)
]

# Filter DataFrame, y creamos el objeto "df_south_america"
df_south_america = df[df["iso2_code"].isin(south_america_codes)]
df_south_america

     iso2_code  year  quarter  num_repos
5           BR  2020        1    3602025
26          CO  2020        1     678828
31          AR  2020        1     608445
49          PE  2020        1     356948
50          CL  2020        1     353627
...        ...   ...      ...        ...
4566        UY  2025        1     257655
4583        PY  2025        1     126185
4651        GY  2025        1       7650
4656        SR  2025        1       5915
4672        GF  2025        1       3065

[273 rows x 4 columns]

In [101]:
#Ahora, quiero saber cuantas observaciones tengo. Para eso usamos shape (observaciones, columnas)
df_south_america.shape
#Para ver todas mis columnas
df_south_america. columns

Index(['iso2_code', 'year', 'quarter', 'num_repos'], dtype='object')

# Ahora vamos a ordenar la BD por columnas

In [102]:
# Reorder columns
df_south_america = df_south_america[["iso2_code", "year", "quarter", "num_repos"]]
df_south_america

#Aquí no estamos ordenando por sort.values, sino ordenando por indexación

     iso2_code  year  quarter  num_repos
5           BR  2020        1    3602025
26          CO  2020        1     678828
31          AR  2020        1     608445
49          PE  2020        1     356948
50          CL  2020        1     353627
...        ...   ...      ...        ...
4566        UY  2025        1     257655
4583        PY  2025        1     126185
4651        GY  2025        1       7650
4656        SR  2025        1       5915
4672        GF  2025        1       3065

[273 rows x 4 columns]

In [111]:
#Corregimos la indexación para ordenarlo de 0 a 4672
df_south_america.reset_index(inplace=True)
df_south_america

#Phyton me genero una columna index nueva, porque así me guarda la indexación pasada. Podemos borrarla, pero la dejamos

     level_0  index iso2_code  year  quarter  num_repos
0          0      0        BR  2020        1    3602025
1          1      1        CO  2020        1     678828
2          2      2        AR  2020        1     608445
3          3      3        PE  2020        1     356948
4          4      4        CL  2020        1     353627
..       ...    ...       ...   ...      ...        ...
268      268    268        UY  2025        1     257655
269      269    269        PY  2025        1     126185
270      270    270        GY  2025        1       7650
271      271    271        SR  2025        1       5915
272      272    272        GF  2025        1       3065

[273 rows x 6 columns]

In [130]:
print(df_south_america.columns.tolist())

['iso2_code', 'year', 'quarter', 'num_repos']

In [113]:
#Ahora ordenamos de manera ascendente. Eso, por el TRUE
df_south_america = df_south_america.sort_values(
    by=["iso2_code", "year", "quarter"],
    ascending=[True, True, True]
)
df_south_america

     level_0  index iso2_code  year  quarter  num_repos
2          2      2        AR  2020        1     608445
15        15     15        AR  2020        2     670189
28        28     28        AR  2020        3     737110
41        41     41        AR  2020        4     802976
54        54     54        AR  2021        1     867545
..       ...    ...       ...   ...      ...        ...
214      214    214        VE  2024        1     321927
227      227    227        VE  2024        2     339253
240      240    240        VE  2024        3     353254
253      253    253        VE  2024        4     362967
266      266    266        VE  2025        1     380857

[273 rows x 6 columns]

In [131]:
df_south_america.drop("index", axis=1, inplace=True)
df_south_america

KeyError: "['index'] not found in axis"

In [132]:
df_south_america

    iso2_code  year  quarter  num_repos
2          AR  2020        1     608445
15         AR  2020        2     670189
28         AR  2020        3     737110
41         AR  2020        4     802976
54         AR  2021        1     867545
..        ...   ...      ...        ...
214        VE  2024        1     321927
227        VE  2024        2     339253
240        VE  2024        3     353254
253        VE  2024        4     362967
266        VE  2025        1     380857

[273 rows x 4 columns]

In [119]:
#Ahora veo la cantidad de observaciones que hay por columna
df_south_america.iso2_code.nunique()

13

In [121]:
df_south_america.year.nunique()

6

In [123]:
df_south_america.quarter.nunique()

4

In [124]:
#Multiplicamos 13*6*4 = 312
#La base de datos no esta balanceada. Esto implica que hay filas que no poseen datos completos
#Sabemos que la base de datos posee 273 observaciones, entonces hay un problema de balanceo
#Debemos entonces, conseguir las 312 observaciones

In [135]:
import pandas as pd

# Ensure correct order and types
df_south_america = df_south_america[["iso2_code", "year", "quarter", "num_repos"]].copy()
df_south_america["year"] = df_south_america["year"].astype(int)
df_south_america["quarter"] = df_south_america["quarter"].astype(int)

# Define the full cartesian product (all combos)
all_iso2   = sorted(df_south_america["iso2_code"].unique())
all_years  = sorted(df_south_america["year"].unique())
all_quarts = [1, 2, 3, 4]   # or: sorted(df_south_america["quarter"].unique())

full_index = pd.MultiIndex.from_product(
    [all_iso2, all_years, all_quarts],
    names=["iso2_code", "year", "quarter"]
)

# Reindex to the full panel
balanced = (
    df_south_america
    .set_index(["iso2_code", "year", "quarter"])
    .reindex(full_index)
    .reset_index()
)
balanced

    iso2_code  year  quarter  num_repos
0          AR  2020        1   608445.0
1          AR  2020        2   670189.0
2          AR  2020        3   737110.0
3          AR  2020        4   802976.0
4          AR  2021        1   867545.0
..        ...   ...      ...        ...
307        VE  2024        4   362967.0
308        VE  2025        1   380857.0
309        VE  2025        2        NaN
310        VE  2025        3        NaN
311        VE  2025        4        NaN

[312 rows x 4 columns]

In [140]:
# Optional: fill missing outcomes (choose ONE)
# If you'd rather keep them as NaN (to impute later), skip the fill.

# Final order & sort
balanced = balanced.sort_values(["iso2_code", "year", "quarter"]).reset_index(drop=True)

# Quick checks
print(balanced.shape)            # should be (312, 4)
print(balanced["num_repos"].isna().sum(), "missing cells created")

# If you want to see which combos were missing:
missing = balanced[balanced["num_repos"].isna()][["iso2_code", "year", "quarter"]]
# print(missing.head())

balanced

(312, 4)
39 missing cells created

    iso2_code  year  quarter  num_repos
0          AR  2020        1   608445.0
1          AR  2020        2   670189.0
2          AR  2020        3   737110.0
3          AR  2020        4   802976.0
4          AR  2021        1   867545.0
..        ...   ...      ...        ...
307        VE  2024        4   362967.0
308        VE  2025        1   380857.0
309        VE  2025        2        NaN
310        VE  2025        3        NaN
311        VE  2025        4        NaN

[312 rows x 4 columns]

In [142]:
# If "missing means zero"
balanced["num_repos"] = balanced["num_repos"].fillna(0).astype(int)
balanced

    iso2_code  year  quarter  num_repos
0          AR  2020        1     608445
1          AR  2020        2     670189
2          AR  2020        3     737110
3          AR  2020        4     802976
4          AR  2021        1     867545
..        ...   ...      ...        ...
307        VE  2024        4     362967
308        VE  2025        1     380857
309        VE  2025        2          0
310        VE  2025        3          0
311        VE  2025        4          0

[312 rows x 4 columns]

In [143]:
#Ahora nos piden importar este csv para que lo trabajen
balanced.to_csv("../_data/github_repos_data_2020_2025_sa.csv")